from app import app, db, Lesson

with app.app_context():  # هنا نفتح الـ context
    lesson1 = Lesson(
        title="شرح الوحدة الأولى من الكتاب النظري – البرمجة للصف الأول الثانوي",
        description="شرح مبسط ومفصل لمحتوى الوحدة الأولى من الكتاب النظري لمادة البرمجة للصف الأول الثانوي، باستخدام الذكاء الاصطناعي لتبسيط المعلومة وتوضيح المفاهيم الأساسية بطريقة سهلة تساعد الطلاب على الفهم والتطبيق.",
        video_url="https://www.youtube.com/watch?v=R-wUxNy8gV4",
        subject_id=1  
    )
    lesson2 = Lesson(
        title="برمجة | الوحدة 2 – الدرس 1 و2",
        description="يتناول هذا الفيديو شرح الدرسين الأول والثاني من الوحدة الثانية لمادة البرمجة للصف الأول الثانوي، ويتعمق في موضوع حماية البيانات والملكية الفكرية. يوضح تعريف البيانات الشخصية وتصنيفاتها، وشروط مشاركتها مع أطراف ثالثة، والفرق بين الخصوصية وحقوق الصورة والدعاية. كما يشرح حقوق الملكية الفكرية بأنواعها: الصناعية (براءات الاختراع والعلامات التجارية) وحقوق المؤلف، مع بيان شروط الحماية ومدتها",
        video_url="https://www.youtube.com/watch?v=jgEP7kiWFdI",
        subject_id=1
    )
    lesson3 = Lesson(
        title="شرح الدرس الثالث – الوحدة الثانية | مادة البرمجة أولى ثانوي ترم أول (من كتاب النظري)",
        description="في الفيديو ده هتتعلم شرح الدرس الثالث من الوحدة الثانية لمادة البرمجة للصف الأول الثانوي – الترم الأول (من كتاب النظري)، بعنوان: تكنولوجيا المعلومات واستخدامها في الكشف عن المعلومات وحماية حقوق المؤلف.",
        video_url="https://www.youtube.com/watch?v=CsbwtxrCKPs&t=1s",
        subject_id=1
    )
    lesson4 = Lesson(
        title="شرح الدروس 1 و2 و3 في الوحدة الثالثة – حماية البيانات والملكية الفكريةأمن المعلومات ملخص مبسط",
        description="في هذا الفيديو يتم شرح الدروس 1 و2 و3 من الوحدة الثالثة لمادة البرمجة والذكاء الاصطناعي لطلاب الصف الأول الثانوي، بطريقة مبسطة وسهلة الفهم.",
        video_url="https://www.youtube.com/watch?v=wVgN1AaC4ww&t=12s",
        subject_id=1
    )
    lesson5 = Lesson(
        title=" شرح الوحدة الرابعة في مادة البرمجة للصف الأول الثانوي | من الحجر إلى السيليكون",
        description="في الفيديو ده هتلاقي شرح كامل للوحدة الرابعة في مادة البرمجة للصف الأول الثانوي بعنوان (من الحجر إلى السيليكون).",
        video_url="https://www.youtube.com/watch?v=LEckWpK8fXo&t=36s",
        subject_id=1
    ) 
    lesson6 = Lesson(
        title="الاتصالات والإنترنت: مراجعة شاملة للوحدة الخامسة في البرمجة | رحلة التواصل المذهلة",
        description="في هذا الفيديو نشرح الوحدة الخامسة في مادة البرمجة للصف الأول الثانوي – الترم الأول بشكل مفصل وسهل",
        video_url="https://www.youtube.com/watch?v=yuFtM3h9aLo&t=5s",
        subject_id=1
    )
    lesson7 = Lesson(
        title="شرح الوحدة السادسة (الجزء الأول): التناظري والرقمي + النظام الثنائي + النظام السداسي العشري",
        description="في الفيديو ده هنشرح أول 3 دروس من الوحدة السادسة ",
        video_url="https://www.youtube.com/watch?v=FYmsRDdeIU4&t=1s",
        subject_id=1
    )
    lesson8 = Lesson(
        title="شرح شامل للدروس 4–6 من الوحدة السادسة | إزاي الكمبيوتر بيفكر؟  (في 6 دقايق فقط!)",
        description="في الفيديو ده هتفهم بطريقة سهلة وسريعة إزاي الكمبيوتر بيفكر، من خلال شرح مبسط للدروس 4 و5 و6 من الوحدة السادسة في مادة البرمجة.",
        video_url="https://www.youtube.com/watch?v=PM9ehirA7DY&t=9s",
        subject_id=1
    )
    lesson9 = Lesson(
        title="شرح دروس 7 و8 و9 و10 - التمثيل والضغط الرقمي بالكامل | أولى ثانوي | شرح كيف تعمل الوسائط الرقمية؟",
        description=" الفيديو ده شرح دروس 7 و8 و9 و10 في مادة الكمبيوتر للصف الأول الثانوي، هنفهم فيه التمثيل الرقمي والضغط الرقمي للصوت والفيديو بطريقة بسيطة وسهلة تساعدك تراجع بسرعة قبل الامتحان.",
        video_url="https://www.youtube.com/watch?v=2wJDlsvxv9w&t=14s",
        subject_id=1
    )
    lesson10 = Lesson(
        title="بنية الكمبيوتر | مكونات الحاسب ووظائفها | أولى ثانوي | مكونات الكمبيوتر الأساسية",
        description="في الفيديو ده هنتعرف على بنية الكمبيوتر ومكوناته الأساسية بطريقة بسيطة وسهلة لطلاب أولى ثانوي – الترم الأول.",
        video_url="https://www.youtube.com/watch?v=LdULt-A3n0E",
        subject_id=1
    )
    lesson11 = Lesson(
        title="الدرس 2 و 3 | الوحدة 7 من مادة البرمجة | شرح مبسط وسهل",
        description="في الفيديو ده هنتعلم الدرس 2 و 3 من الوحدة 7 في مادة البرمجة بطريقة سهلة وبخطوات واضحة، مع أمثلة عملية تساعدك تفهم بسرعة. سواء كنت بتذاكر للصف الأول الثانوي أو عايز تقوي مهاراتك في البرمجة، الفيديو ده ليك.",
        video_url="https://www.youtube.com/watch?v=XIEIubegIDQ",
        subject_id=1
    )
    lesson12 = Lesson(
        title="البرمجة | شرح الدرس 1 و2 و3 من الوحدة الثامنة | أولى ثانوي | رحلة البيانات: كيف يعمل الإنترنت؟",
        description="شرح الدرس 1 و2 و3 من الوحدة الثامنة في البرمجة، مع تحسين جودة الشرح باستخدام أدوات الذكاء الاصطناعي لتسهيل الفهم والتطبيق. ",
        video_url="https://www.youtube.com/watch?v=Xyxwr16CPGo",
        subject_id=1
    )
    lesson13 = Lesson(
        title="الصف الأول الثانوي – برمجة | الدرس 4 و5 من الوحدة 8 (البريد الإلكتروني وصفحات الويب)",
        description="الدرس 4 و5 من الوحدة 8 في البرمجة للصف الأول الثانوي، تم شرحه بمساعدة أدوات الذكاء الاصطناعي لتوضيح كيفية عمل صفحات الويب والبريد الإلكتروني بطريقة بسيطة",
        video_url="https://www.youtube.com/watch?v=0heg--5duHM",
        subject_id=1
    )
    lesson14 = Lesson(
        title="مقدمة لقواعد البيانات: أنواعها وتعريفها – الدرس الأول للوحدة 9 | مقدمة عن قواعد البيانات",
        description="في الفيديو ده هنتعرف على أساسيات قواعد البيانات، وهنشرح إيه هي قاعدة البيانات وأنواعها المختلفة بطريقة سهلة وبسيطة للصف الأول الثانوي. الفيديو معمول بمساعدة أدوات الذكاء الاصطناعي لتبسيط الشرح وجعله ممتع وواضح. ",
        video_url="https://www.youtube.com/watch?v=0FjnuR8_vRE",
        subject_id=1
    )
    lesson15 = Lesson(
        title="الدرس 2 | الوحدة 9 | قواعد البيانات العلائقية | كشف أسرار قواعد البيانات قوة التنظيم",
        description="في الفيديو ده هنتعلم الدرس الثاني من الوحدة التاسعة للصف الأول الثانوي عن قواعد البيانات العلائقية بطريقة سهلة وواضحة. هنتعرف على الجداول، الصفوف، الأعمدة، العلاقات بين الجداول، وكمان عمليات الجبر العلائقي زي الانتقاء (Selection)، العرض (Projection)، والربط (Join).",
        video_url="https://www.youtube.com/watch?v=KaCEh2oMkcU",
        subject_id=1
    )
    lesson16 = Lesson(
        title="الوحدة 9 الدرس 3 | نظم المعلومات: TPS – MIS – DSS – EIS – ERP | نظم المعلومات لغة الأعمال",
        description="في الفيديو ده هقعد معاك ونفهم مع بعض درس نظم المعلومات – الدرس الثالث في الوحدة التاسعة من غير تعقيد ومن غير كلام كبير.",
        video_url="https://www.youtube.com/watch?v=iAjzP1e77YI&t=1s",
        subject_id=1
    )
    lesson17 = Lesson(
        title="الدرس الأول – الوحدة العاشرة: أنواع البيانات وطرق تحليلها | قصة البيانات مقدمة في الإحصاء",
        description="في الفيديو ده بشرح لك الدرس الأول من الوحدة العاشرة بطريقة بسيطة وسهلة",
        video_url="https://www.youtube.com/watch?v=TnXunaShu-E",
        subject_id=1
    )
    lesson18 = Lesson(
        title="تفصيص الدرس 2 في الوحدة 10: شرح سهل ومختصر",
        description="في الفيديو ده هتتعلم شرح مبسّط وواضح للدرس الثاني في الوحدة العاشرة من مادة البرمجة والذكاء الاصطناعي – الصف الأول الثانوي.",
        video_url="https://www.youtube.com/watch?v=2-lIlGRamww",
        subject_id=1
    )
    lesson19 = Lesson(
        title="الدرس 3 – الوحدة 10Box Plot | فهم الرباعيات ومخططات الصندوق",
        description="في الفيديو ده بشرح درس الرباعيات ومخطط الصندوق والشارب (الدرس 3 – الوحدة 10) بأسلوب بسيط وواضح. اعتمدت على أدوات ذكاء اصطناعي علشان أقدر أوصل المعلومة بشكل أسهل وأرتّب الشرح بطريقة تساعدك تفهم الدرس من أول مرة. لو محتاج تبسيط أكتر للإحصاء، الفيديو ده معمول ليك.",
        video_url="https://www.youtube.com/watch?v=xWzbNC995Y0",
        subject_id=1
    )
    lesson20 = Lesson(
        title="الوحدة العاشرة: الدرس 4 | التباين والانحراف المعياري | شرح خطوات الحساب والتشتت.",
        description="يا أهلًا بيكم في فيديو جديد! تعالوا نكمل سوا سلسلتنا في تحليل البيانات، وده الدرس الرابع من الوحدة العاشرة (4-10)، ودرس النهارده مهم جدًا!",
        video_url="https://www.youtube.com/watch?v=ESh7s0akaNk",
        subject_id=1
    )
    lesson21 = Lesson(
        title="شرح الدرس 5 الوحدة 10 | تحليل البيانات: الارتباط والمخططات المبعثرة بسهولة",
        description="في الفيديو ده بنشرح الدرس 5 من الوحدة 10 في مادة البرمجة والذكاء الاصطناعي بطريقة بسيطة ومباشرة، وبنوضّح أهم أفكار تحليل البيانات بشكل يساعدك تفهم الدرس بسرعة وتشبّك المعلومات من غير تعقيد.",
        video_url="https://www.youtube.com/watch?v=ckxRep9R3NM",
        subject_id=1
    )
    lesson22 = Lesson(
        title="تحليل الانحدار الخطي|الدرس السادس من الوحدة العاشرة|مادة البرمجة والذكاء الاصطناعي لصف الأول الثانوي",
        description="في الفيديو ده هتتعرف على درس تحليل الانحدار الخطي من الدرس السادس في الوحدة العاشرة بطريقة سهلة وواضحة. هنمشي خطوة بخطوة في المفهوم، وهنشوف أمثلة من الحياة اليومية تخليك فاهم الموضوع بدل ما تحفظه. لو محتاج تجهز للامتحان أو عايز تفهم الدرس بسرعة ومن غير تعقيد، الفيديو ده ليك.",
        video_url="https://www.youtube.com/watch?v=3B1CcOhss4w",
        subject_id=1
    )
    lesson23 = Lesson(
        title="نماذج وتمثيل البيانات | شرح درس الوحدة 11 برمجة أولى ثانوي بسهولة.",
        description="في الفيديو ده هنتعرف على درس النماذج (Modeling) من الوحدة 11 بطريقة بسيطة وواضحة.",
        video_url="https://www.youtube.com/watch?v=4Gfs_vZwR_g",
        subject_id=1
    )
    lesson24 = Lesson(
        title="الدرس 2 – الوحدة 11: المحاكاة والمراجع في Excel | البرمجة والذكاء الاصطناعي للصف الأول الثانوي.",
        description="شرح الدرس 2 من الوحدة 11 في البرمجة والذكاء الاصطناعي للصف الأول الثانوي: المحاكاة في Excel، المراجع النسبية",
        video_url="https://www.youtube.com/watch?v=O-1-781gpBM",
        subject_id=1
    )
    lesson25 = Lesson(
        title="الدرس 3 – الوحدة 11: المحاكاة الاحتمالية وطريقة مونت كارلو لتقريب قيمة π | البرمجة والذكاء اصطناعي .",
        description="في الفيديو ده هنتعرف على الدرس 3 من الوحدة 11 لمادة البرمجة والذكاء الاصطناعي، وهنشوف إزاي نستخدم المحاكاة الاحتمالية وطريقة مونت كارلو علشان نقرب قيمة π بسهولة. هنتعلم إزاي الأعداد العشوائية ممكن تساعدنا نحل مشاكل بطريقة ممتعة وعملية، ونشوف التجربة بنفسنا خطوة خطوة. الفيديو مناسب لكل طلاب الثانوي، وبأسلوب مبسط وسلس.",
        video_url="https://www.youtube.com/watch?v=AroSy8mLQgE",
        subject_id=1
    )
    lesson26 = Lesson(
        title="CPU بيشتغل زي كاشير السوبر ماركت؟ شرح درس الطوابير (Queues) | درس 4 – الوحدة 11 – برمجة",
        description="في الفيديو ده هنفهم فكرة الطوابير (Queues) بشكل سريع وبسيط، من خلال مثال كاشير السوبر ماركت، وهربطها مباشرة بالطريقة اللي بيشتغل بيها الـ CPU داخل الكمبيوتر. لو أنت في أولى ثانوي وعاوز توصل للفكرة بسرعة، الفيديو هيشرح لك الدرس الرابع من الوحدة 11 بشكل واضح ومن غير تعقيد.",
        video_url="https://www.youtube.com/watch?v=y7sMLWGZLNI&t=6s",
        subject_id=1
    )
    lesson27 = Lesson(
        title="شرح الخوارزميات للصف الأول الثانوي | مفهوم الخوارزمية والمخططات الانسيابية | الدرس 1 | الوحدة 12",
        description="في الفيديو ده هنفهم مع بعض يعني إيه خوارزمية، وليه بنستخدم المخططات الانسيابية، وإزاي نقدر نمثل أي خطوة أو فكرة بشكل منظم وبسيط. الشرح موجه لطلاب الصف الأول الثانوي، وهنمشي خطوة بخطوة مع أمثلة من الحياة اليومية علشان المعلومة تثبت وتبقى واضحة. لو لسه جديد على الوحدة 12، الفيديو ده هيكون بداية سهلة تساعدك تفهم الأساس قبل ما تكمل باقي الدروس.",
        video_url="https://www.youtube.com/watch?v=3lmu3bXExqo",
        subject_id=1
    )
    lesson28 = Lesson(
        title="أساسيات البرمجة | الدرس 2 من الوحدة 12 | تعلم البرمجة بسهولة",
        description="في الدرس ده هنتعرف على أساسيات البرمجة: المتغيرات، البنية التسلسلية، وكيفية استخدام الأمر print() لعرض النصوص والقيم. هنتعلم كمان معامل التخصيص (=) والمعاملات الحسابية زي الجمع والطرح والقسمة وباقي القسمة والقوة، مع أمثلة برمجية واضحة. فيديو تعليمي ممتاز للمبتدئين لفهم أساسيات البرمجة بسهولة.",
        video_url="https://www.youtube.com/watch?v=dsUEn79W8rc&t=2s",
        subject_id=1
    )
    lesson29 = Lesson(
        title="شرح الحلقة التكرارية for والتفرع if في Python | أساسيات البرمجة للثانوي | الدرس 3 | الوحده 12",
        description="شرح مبسط لدرس التكرار والتفرع في البرمجة باستخدام Python لطلاب الصف الثانوي.",
        video_url="https://www.youtube.com/watch?v=YtFWIFChDy4&t=1s",
        subject_id=1
    )
    lesson30 = Lesson(
        title="القوائم (List – Array) في البرمجة | شرح مبسط مع أمثلة واقعية | أولى ثانوي", 
        description="في الفيديو ده هتتعلم شرح القوائم List و Array في البرمجة للصف الأول الثانوي بطريقة بسيطة وسهلة، مع أمثلة من الحياة اليومية تساعدك تفهم الفكرة من غير تعقيد.",
        video_url="https://www.youtube.com/watch?v=BmdNyW6m7E8&t=1s",
        subject_id=1
    )
    lesson31 = Lesson(
        title="يعني إيه Function؟ | شرح الدوال في البرمجة بأمثلة من الحياة | أولى ثانوي",
        description="في الفيديو ده هتتعلم شرح الدوال (Functions) في البرمجة بأسلوب مبسط ومناسب لطلاب الصف الأول الثانوي، مع توضيح معنى.",
        video_url="https://www.youtube.com/watch?v=K53AKSA3Mx8",
        subject_id=1
    )
    lesson32 = Lesson(
        title="شرح أول 3 فصول من مادة البرمجة للصف الأول الثانوي – الترم الأول | شرح مبسط باستخدام الذكاء الاصطناعي",
        description="في الفيديو ده بشرح أول 3 فصول من مادة البرمجة للصف الأول الثانوي الترم الأول، بطريقة بسيطة وسهلة باستخدام الذكاء الاصطناعي.",
        video_url="https://www.youtube.com/watch?v=C28drAX0CFk&t=4s",
        subject_id=2
    )
    lesson33 = Lesson(
        title="شرح الفصول 5 و6 و7 في البرمجة | جمل if و else if و else للصف الأول الثانوي",
        description="في الفيديو ده هنشرح مع بعض الفصول 5 و6 و7 من منهج البرمجة للصف الأول الثانوي، وهنفهم بطريقة بسيطة وعمليّة جمل if و else if و else، وازاي نستخدمها في كتابة الأكواد واتخاذ القرارات داخل البرنامج.",
        video_url="https://www.youtube.com/watch?v=JFDjm8Y15Yg&t=5s",
        subject_id=2
    )
    lesson34 = Lesson(
        title="شرح الوحدة 9 و10 من مادة البرمجة للصف الأول الثانوي | الجزء الخاص بالمنصة التعليمية",
        description="الفيديو من إعداد الطالب يحيى محمد، يقدّم شرحًا لوحدتي 9 و10 من مادة البرمجة للصف الأول الثانوي، الجزء المخصص للمنصة التعليمية.",
        video_url="https://www.youtube.com/watch?v=NJci-VYpVfU&t=37s",
        subject_id=2
    )
    lesson35 = Lesson(
        title="شرح الشبتر 12 و 13 من منصة Qureo | الصف الأول الثانوي | قوة الدوال في البرمجة",
        description="في الفيديو ده هنتعرف على الدوال في البرمجة من الشبتر 12 و13 على منصة Qureo للصف الأول الثانوي. الفيديو معمول بمساعدة أدوات الذكاء الاصطناعي لتسهيل الشرح وتوضيح المفاهيم بطريقة بسيطة وسهلة.",
        video_url="https://www.youtube.com/watch?v=9IUt9OfiFeY",
        subject_id=2
    )
    lesson36 = Lesson(
        title="شرح الشابتر 15 و16 من منصة Qureo | فك شفرة البرمجة أول أدوات.",
        description="شرح الشبتر 15 و 16 من منصة Qureo للصف الاول الثانوي  (شرح نظري فقط بدون فتح المنصة)",
        video_url="https://www.youtube.com/watch?v=TcRJceKMGKk",
        subject_id=2
    )
    db.session.add_all([lesson1, lesson2, lesson3, lesson4, lesson5, lesson6, lesson7, lesson8, lesson9, lesson10, lesson11, lesson12, lesson13,
    lesson14, lesson15, lesson16, lesson17, lesson18, lesson19, lesson20, lesson21, lesson22, lesson23, lesson24, lesson25, lesson26, lesson27, lesson28,
    lesson29, lesson30, lesson31, lesson32, lesson33, lesson34, lesson35, lesson36])
    db.session.commit()

    print("Lesson added successfully!")
